-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Мар 04 2021 г., 06:04
-- Версия сервера: 10.4.13-MariaDB
-- Версия PHP: 7.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `yiiconvert`
--

-- --------------------------------------------------------

--
-- Структура таблицы `currency`
--

CREATE TABLE `currency` (
  `id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `rate` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `insert_dt` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `currency`
--

INSERT INTO `currency` (`id`, `name`, `rate`, `insert_dt`) VALUES
(1, 'Австралийский доллар', '57,5284', 1614832887),
(2, 'Азербайджанский манат', '43,2717', 1614832887),
(3, 'Фунт стерлингов Соединенного королевства', '102,6762', 1614832887),
(4, 'Армянских драмов', '13,9438', 1614832887),
(5, 'Белорусский рубль', '28,1918', 1614832887),
(6, 'Болгарский лев', '45,4071', 1614832888),
(7, 'Бразильский реал', '12,9516', 1614832888),
(8, 'Венгерских форинтов', '24,4244', 1614832888),
(9, 'Гонконгских долларов', '94,7833', 1614832888),
(10, 'Датская крона', '11,9430', 1614832888),
(11, 'Доллар США', '73,5187', 1614832888),
(12, 'Евро', '88,8768', 1614832888),
(13, 'Индийских рупий', '10,0814', 1614832888),
(14, 'Казахстанских тенге', '17,5216', 1614832888),
(15, 'Канадский доллар', '58,2696', 1614832888),
(16, 'Киргизских сомов', '86,6572', 1614832888),
(17, 'Китайский юань', '11,3771', 1614832888),
(18, 'Молдавских леев', '41,7720', 1614832888),
(19, 'Норвежских крон', '86,8153', 1614832888),
(20, 'Польский злотый', '19,5898', 1614832888),
(21, 'Румынский лей', '18,2117', 1614832888),
(22, 'СДР (специальные права заимствования)', '105,5589', 1614832888),
(23, 'Сингапурский доллар', '55,2814', 1614832888),
(24, 'Таджикских сомони', '64,5184', 1614832888),
(25, 'Турецкая лира', '10,0461', 1614832888),
(26, 'Новый туркменский манат', '21,0354', 1614832889),
(27, 'Узбекских сумов', '70,0176', 1614832889),
(28, 'Украинских гривен', '26,3626', 1614832889),
(29, 'Чешских крон', '33,9782', 1614832889),
(30, 'Шведских крон', '87,6099', 1614832889),
(31, 'Швейцарский франк', '80,2168', 1614832889),
(32, 'Южноафриканских рэндов', '49,4373', 1614832889),
(33, 'Вон Республики Корея', '65,5676', 1614832889),
(34, 'Японских иен', '68,7798', 1614832889);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `currency`
--
ALTER TABLE `currency`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `currency`
--
ALTER TABLE `currency`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
